# The module 12 by analytics : Pandas(1)

In [2]:
import pandas as pd

In [3]:
df = pd.DataFrame([['Anna', 23, 13],
                   ['Gena', 12, 15],
                   ['Vera', 28, None],
                   ])
df

      0   1     2
0  Anna  23  13.0
1  Gena  12  15.0
2  Vera  28   NaN

In [4]:
type(df)

pandas.core.frame.DataFrame

In [5]:
ser1 = pd.Series([1, 2, 3])
ser1

0    1
1    2
2    3
dtype: int64

In [6]:
type(df[0])

pandas.core.series.Series

In [9]:
df.columns = ['name', 'age', 'expr']
df

   name  age  expr
0  Anna   23  13.0
1  Gena   12  15.0
2  Vera   28   NaN

In [27]:
df.iloc[0:2, 0]

0    Anna
1    Gena
Name: name, dtype: object

In [31]:
df.iloc[:]['name'] == df.iloc[:,0]

0    True
1    True
2    True
Name: name, dtype: bool

In [37]:
df.iloc[0:2, :2]

   name  age
0  Anna   23
1  Gena   12

In [38]:
df[['name', 'expr']]

   name  expr
0  Anna  13.0
1  Gena  15.0
2  Vera   NaN

In [40]:
df.index = df['name']
df

      name  age  expr
name
Anna  Anna   23  13.0
Gena  Gena   12  15.0
Vera  Vera   28   NaN

In [42]:
df.loc['Gena': 'Vera', 'age']

name
Gena    12
Vera    28
Name: age, dtype: int64

In [43]:
df.loc['Gena': 'Vera', ['age', 'expr']]

# => return mini DataFrame with to need rows and columns

      age  expr
name
Gena   12  15.0
Vera   28   NaN

In [44]:
df.info()

<class 'pandas.core.frame.DataFrame'>
Index: 3 entries, Anna to Vera
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   name    3 non-null      object
 1   age     3 non-null      int64
 2   expr    2 non-null      float64
dtypes: float64(1), int64(1), object(1)
memory usage: 204.0+ bytes

In [46]:
type(df.columns)

pandas.core.indexes.base.Index

In [47]:
df.head()

      name  age  expr
name
Anna  Anna   23  13.0
Gena  Gena   12  15.0
Vera  Vera   28   NaN

In [48]:
df.tail()

      name  age  expr
name
Anna  Anna   23  13.0
Gena  Gena   12  15.0
Vera  Vera   28   NaN

In [53]:
df.dropna()
# return new object of the DataFrame 
#so you need to create new variable for its

      name  age  expr
name
Anna  Anna   23  13.0
Gena  Gena   12  15.0

In [54]:
df[df['age'] > 15]

      name  age  expr
name
Anna  Anna   23  13.0
Vera  Vera   28   NaN

In [57]:
df[(df['age'] > 15) & (df['expr']>10)]
# try to point out several conditions

      name  age  expr
name
Anna  Anna   23  13.0

In [59]:
# create new colums on the basis of the old column
df['are_sq'] = df['age'] ** 2
df

      name  age  expr  are_sq
name
Anna  Anna   23  13.0     529
Gena  Gena   12  15.0     144
Vera  Vera   28   NaN     784

In [61]:
df['status'] = 'W'
df

      name  age  expr  are_sq status
name
Anna  Anna   23  13.0     529      W
Gena  Gena   12  15.0     144      W
Vera  Vera   28   NaN     784      W

In [64]:
df['gender'] = [0, 1, 0]
df

      name  age  expr  are_sq status  gender
name
Anna  Anna   23  13.0     529      W       0
Gena  Gena   12  15.0     144      W       1
Vera  Vera   28   NaN     784      W       0

In [66]:
df['no_work'] = df['age'] - df['expr']
df

      name  age  expr  are_sq status  gender  no_work
name
Anna  Anna   23  13.0     529      W       0     10.0
Gena  Gena   12  15.0     144      W       1     -3.0
Vera  Vera   28   NaN     784      W       0      NaN

In [4]:
import numpy as np
W = np.array([1, 2, 3])
W

array([1, 2, 3])

In [7]:
W.transpose()

array([1, 2, 3])